{
  "0": 113,
  "1": 29,
  "2": 131,
  "3": 165,
  "4": 167,
  "5": 166,
  "6": 266,
  "7": 263,
  "8": 251,
  "9": 261,
  "10": 264,
  "11": 897,
  "12": 475,
  "13": 687,
  "14": 898,
  "15": 393,
  "16": 170,
  "17": 619,
  "18": 1152,
  "19": 1129,
  "20": 74,
  "21": 776,
  "22": 1390,
  "23": 1781,
  "24": 2103,
  "25": 656,
  "26": 1447,
  "27": 1019,
  "28": 2139,
  "29": 1153,
  "30": 646,
  "31": 1007,
  "32": 742,
  "33": 618,
  "34": 1154,
  "35": 1008,
  "36": 1599,
  "37": 1009,
  "38": 1155,
  "39": 3539,
  "40": 1131,
  "41": 3707,
  "42": 2670,
  "43": 1047,
  "44": 1391,
  "45": 717,
  "48": 2910,
  "49": 1156,
  "50": 379,
  "51": 1010,
  "53": 1011,
  "54": 3517,
  "55": 1012,
  "56": 3540,
  "57": 1013,
  "58": 3346,
  "59": 1132,
  "60": 883,
  "61": 1157,
  "62": 4562,
  "64": 2818,
  "65": 4378,
  "66": 1392,
  "67": 1158,
  "68": 1725,
  "70": 1769,
  "71": 1014,
  "72": 1159,
  "73": 1015,
  "75": 655,
  "76": 1160,
  "77": 1016,
  "79": 2819,
  "80": 2526,
  "81": 1020,
  "83": 1161,
  "84": 1510,
  "85": 2122,
  "88": 1393,
  "90": 1964,
  "91": 4639,
  "92": 751,
  "94": 1046,
  "95": 2584,
  "97": 2820,
  "98": 3721,
  "99": 1394,
  "100": 147,
  "101": 2981,
  "102": 2592,
  "103": 3731,
  "104": 172,
  "105": 641,
  "106": 1808,
  "107": 2319,
  "108": 1263,
  "109": 132,
  "110": 2404,
  "111": 3476,
  "112": 4363,
  "114": 3421,
  "115": 191,
  "116": 193,
  "120": 1767,
  "121": 4364,
  "122": 2563,
  "123": 3515,
  "124": 3954,
  "126": 4158,
  "128": 4474,
  "129": 4468,
  "131": 3422,
  "132": 4359,
  "135": 3420,
  "140": 3402,
  "141": 3603,
  "144": 1496,
  "150": 1770,
  "160": 3705,
  "162": 4570,
  "167": 4093,
  "170": 4584,
  "180": 518,
  "181": 1740,
  "184": 3396,
  "190": 2581,
  "200": 476,
  "210": 2718,
  "211": 4365,
  "213": 4360,
  "215": 3961,
  "218": 3488,
  "220": 3401,
  "226": 1460,
  "231": 187,
  "233": 4738,
  "234": 4739,
  "240": 2521,
  "243": 1021,
  "245": 1501,
  "250": 4515,
  "260": 2525,
  "262": 1395,
  "280": 3914,
  "293": 4469,
  "300": 1811,
  "312": 4361,
  "321": 4362,
  "327": 2963,
  "331": 3493,
  "365": 1351,
  "400": 3504,
  "403": 200,
  "408": 4566,
  "417": 216,
  "433": 215,
  "444": 1048,
  "500": 431,
  "501": 1261,
  "512": 3952,
  "525": 4514,
  "551": 1004,
  "595": 4179,
  "600": 507,
  "625": 671,
  "660": 2636,
  "667": 4840,
  "684": 4258,
  "700": 503,
  "701": 4472,
  "706": 3260,
  "729": 1022,
  "800": 2970,
  "977": 2121,
  "981": 1968,
  "985": 4513,
  "999": 395,
  "1000": 32,
  "1010": 2828,
  "1011": 3684,
  "1013": 4583,
  "1015": 3775,
  "1022": 3647,
  "1110": 2833,
  "1124": 3956,
  "1317": 2081,
  "1350": 3624,
  "1690": 3810,
  "2000": 1174,
  "2124": 3957,
  "2187": 1024,
  "2282": 4569,
  "2354": 3487,
  "2500": 3999,
  "2936": 4470,
  "3000": 3350,
  "3124": 3958,
  "3131": 1163,
  "3500": 2966,
  "4000": 3447,
  "4124": 3959,
  "5000": 432,
  "5124": 3960,
  "5125": 3950,
  "5131": 3489,
  "5232": 4572,
  "5701": 4475,
  "6000": 3953,
  "6561": 1026,
  "7012": 4476,
  "7772": 2118,
  "8760": 1969,
  "8858": 4565,
  "10000": 2079,
  "10100": 3722,
  "10101": 4819,
  "10110": 3798,
  "10301": 3508,
  "10330": 3506,
  "10331": 3507,
  "11100": 3276,
  "11106": 1454,
  "11111": 3250,
  "12345": 4366,
  "12936": 4467,
  "13301": 3509,
  "19683": 1028,
  "21851": 3490,
  "22233": 3300,
  "29523": 1018,
  "31121": 4571,
  "50000": 615,
  "57012": 4478,
  "60000": 790,
  "62500": 668,
  "66045": 2466,
  "66667": 2159,
  "70128": 4479,
  "71875": 672,
  "73278": 792,
  "89898": 4180,
  "99999": 3513,
  "100011": 2831,
  "101010": 2832,
  "101101": 3634,
  "102112": 4567,
  "103301": 3505,
  "111000": 2830,
  "111001": 4736,
  "111101": 3636,
  "111110": 3637,
  "111111": 3638,
  "165462": 3516,
  "238182": 3518,
  "570128": 4480,
  "580986": 2917,
  "701283": 4481,
  "1001010": 3352,
  "1011010": 3425,
  "1100101": 3220,
  "1101100": 3426,
  "1110100": 3427,
  "1111000": 3428,
  "1351315": 1005,
  "1389537": 1612,
  "2266622": 3297,
  "2354218": 3491,
  "3312958": 3492,
  "5701283": 4471,
  "10110101": 3248,
  "30228214": 2070,
  "50734910": 2637,
  "82876089": 3310,
  "83943898": 3887,
  "100000000": 1262,
  "100000009": 617,
  "104860361": 313,
  "136006598": 1164,
  "183236316": 4820,
  "222616187": 1665,
  "647427950": 2768,
  "796297179": 2420,
  "991600007": 4582,
  "1000000000": 1017,
  "1010101010": 4482,
  "1050734917": 2635,
  "1100011000": 3794,
  "1101001000": 3797,
  "1101111000": 3796,
  "2082876103": 3311,
  "3104860382": 314,
  "3796297200": 2421,
  "medium": 0,
  "two": 1,
  "pointers": 2,
  "string": 3,
  "dynamic": 4,
  "programming": 5,
  "given": 6,
  "s": 7,
  "return": 8,
  "longest": 9,
  "palindromic": 10,
  "substring": 11,
  "example": 12,
  "1:": 13,
  "input:": 14,
  "=": 15,
  "babad": 16,
  "output:": 17,
  "bab": 18,
  "explanation:": 19,
  "aba": 20,
  "is": 21,
  "also": 22,
  "valid": 23,
  "answer": 24,
  "2:": 25,
  "cbbd": 26,
  "bb": 27,
  "constraints:": 28,
  "<=": 30,
  "length": 31,
  "consist": 33,
  "digits": 34,
  "english": 35,
  "letters": 36,
  "hard": 37,
  "recursion": 38,
  "input": 39,
  "sand": 40,
  "pattern": 41,
  "p": 42,
  "implement": 43,
  "regular": 44,
  "expression": 45,
  "matching": 46,
  "support": 47,
  "*": 48,
  "where:": 49,
  "matches": 50,
  "single": 51,
  "character": 52,
  "zero": 53,
  "preceding": 54,
  "element": 55,
  "should": 56,
  "cover": 57,
  "entire": 58,
  "partial": 59,
  "aa": 60,
  "false": 61,
  "does": 62,
  "match": 63,
  "a*": 64,
  "true": 65,
  "means": 66,
  "therefore": 67,
  "repeating": 68,
  "it": 69,
  "becomes": 70,
  "3:": 71,
  "ab": 72,
  "length<=": 73,
  "contains": 75,
  "lowercase": 76,
  "guaranteed": 77,
  "appearance": 78,
  "be": 79,
  "previous": 80,
  "array": 81,
  "matrix": 82,
  "you": 83,
  "are": 84,
  "m": 85,
  "x": 86,
  "n": 87,
  "integer": 88,
  "grid": 89,
  "robot": 90,
  "initially": 91,
  "located": 92,
  "top": 93,
  "left": 94,
  "corner": 95,
  "i": 96,
  "e": 97,
  "grid[0][0]": 98,
  "tries": 99,
  "move": 100,
  "bottom": 101,
  "right": 102,
  "grid[m": 103,
  "1][n": 104,
  "1]": 105,
  "either": 106,
  "point": 107,
  "time": 108,
  "obstacle": 109,
  "space": 110,
  "marked": 111,
  "as": 112,
  "respectively": 114,
  "path": 115,
  "that": 116,
  "takes": 117,
  "cannot": 118,
  "include": 119,
  "square": 120,
  "number": 121,
  "possible": 122,
  "unique": 123,
  "paths": 124,
  "take": 125,
  "reach": 126,
  "testcases": 127,
  "generated": 128,
  "less": 129,
  "equal": 130,
  "obstaclegrid": 133,
  "[[0": 134,
  "0]": 135,
  "[0": 136,
  "0]]": 137,
  "one": 138,
  "middle": 139,
  "3x3": 140,
  "above": 141,
  "ways": 142,
  "corner:": 143,
  ">": 144,
  "==": 145,
  "obstaclegrid[i]": 146,
  "obstaclegrid[i][j]": 148,
  "backtracking": 149,
  "bit": 150,
  "manipulation": 151,
  "memoization": 152,
  "bitmask": 153,
  "nums": 154,
  "k": 155,
  "divide": 156,
  "this": 157,
  "into": 158,
  "non": 159,
  "empty": 160,
  "subsets": 161,
  "whose": 162,
  "sums": 163,
  "[4": 164,
  "[1": 168,
  "4]": 169,
  "nums[i]": 171,
  "frequency": 173,
  "range": 174,
  "strings": 175,
  "s1": 176,
  "ands2": 177,
  "lowest": 178,
  "ascii": 179,
  "sum": 180,
  "deleted": 181,
  "characters": 182,
  "make": 183,
  "sea": 184,
  "s2": 185,
  "eat": 186,
  "deleting": 188,
  "adds": 189,
  "value": 190,
  "t": 192,
  "end": 194,
  "+": 195,
  "minimum": 196,
  "achieve": 197,
  "delete": 198,
  "leet": 199,
  "dee": 201,
  "turn": 202,
  "let": 203,
  "100[d]": 204,
  "101[e]": 205,
  "100+101+101+101": 206,
  "instead": 207,
  "we": 208,
  "turned": 209,
  "lee": 210,
  "eet": 211,
  "would": 212,
  "get": 213,
  "answers": 214,
  "which": 217,
  "higher": 218,
  "greedy": 219,
  "prices": 220,
  "where": 221,
  "prices[i]": 222,
  "price": 223,
  "stock": 224,
  "ith": 225,
  "day": 226,
  "fee": 227,
  "representing": 228,
  "transaction": 229,
  "find": 230,
  "maximum": 231,
  "profit": 232,
  "may": 233,
  "complete": 234,
  "many": 235,
  "transactions": 236,
  "like": 237,
  "need": 238,
  "pay": 239,
  "note:": 240,
  "engage": 241,
  "multiple": 242,
  "simultaneously": 243,
  "must": 244,
  "sell": 245,
  "before": 246,
  "buy": 247,
  "charged": 248,
  "purchase": 249,
  "sale": 250,
  "9]": 252,
  "achieved": 253,
  "by:": 254,
  "buying": 255,
  "prices[0]": 256,
  "selling": 257,
  "prices[3]": 258,
  "prices[4]": 259,
  "prices[5]": 260,
  "total": 262,
  "3]": 265,
  "<": 267,
  "binary": 268,
  "search": 269,
  "sliding": 270,
  "window": 271,
  "rolling": 272,
  "hash": 273,
  "function": 274,
  "arrays": 275,
  "nums1": 276,
  "nums2": 277,
  "subarray": 278,
  "appears": 279,
  "[3": 280,
  "7]": 281,
  "repeated": 282,
  "nums1[i]": 283,
  "nums2[i]": 284,
  "different": 285,
  "subsequences": 286,
  "since": 287,
  "large": 288,
  "modulo": 289,
  "subsequence": 290,
  "obtained": 291,
  "sequence": 292,
  "reversed": 293,
  "sequences": 294,
  "a1": 295,
  "a2": 296,
  "b1": 297,
  "b2": 298,
  "ai": 299,
  "bi": 300,
  "bccb": 301,
  "b": 302,
  "c": 303,
  "cc": 304,
  "bcb": 305,
  "note": 306,
  "counted": 307,
  "even": 308,
  "though": 309,
  "occurs": 310,
  "twice": 311,
  "abcdabcdabcdabcdabcdabcdabcdabcddcbadcbadcbadcbadcbadcbadcbadcba": 312,
  "s[i]": 315,
  "d": 316,
  "table": 317,
  "want": 318,
  "maximize": 319,
  "points": 320,
  "performing": 321,
  "following": 322,
  "operation": 323,
  "times:": 324,
  "pick": 325,
  "earn": 326,
  "afterwards": 327,
  "every": 328,
  "applying": 329,
  "times": 330,
  "2]": 331,
  "perform": 332,
  "operations:": 333,
  "consequently": 334,
  "[2]": 335,
  "[]": 336,
  "[2": 337,
  "[3]": 338,
  "field": 339,
  "cherries": 340,
  "cell": 341,
  "three": 342,
  "integers": 343,
  "pass": 344,
  "through": 345,
  "cherry": 346,
  "thorn": 347,
  "blocks": 348,
  "your": 349,
  "way": 350,
  "collect": 351,
  "rules": 352,
  "below:": 353,
  "starting": 354,
  "position": 355,
  "reaching": 356,
  "moving": 357,
  "cells": 358,
  "after": 359,
  "returning": 360,
  "when": 361,
  "passing": 362,
  "containing": 363,
  "between": 364,
  "collected": 365,
  "1]]": 366,
  "player": 367,
  "started": 368,
  "went": 369,
  "were": 370,
  "picked": 371,
  "during": 372,
  "trip": 373,
  "home": 374,
  "picking": 375,
  "[[1": 376,
  "[": 377,
  "grid[i]": 378,
  "grid[i][j]": 380,
  "grid[n": 381,
  "easy": 382,
  "cost": 383,
  "cost[i]": 384,
  "step": 385,
  "staircase": 386,
  "climb": 387,
  "steps": 388,
  "start": 389,
  "index": 390,
  "floor": 391,
  "[10": 392,
  "20]": 394,
  "have": 396,
  "values": 397,
  "except": 398,
  "indices": 399,
  "mines": 400,
  "defined": 401,
  "mines[i]": 402,
  "[xi": 403,
  "yi]": 404,
  "grid[xi][yi]": 405,
  "order": 406,
  "largest": 407,
  "axis": 408,
  "aligned": 409,
  "plus": 410,
  "sign": 411,
  "contained": 412,
  "none": 413,
  "has": 414,
  "center": 415,
  "grid[r][c]": 416,
  "along": 417,
  "four": 418,
  "arms": 419,
  "going": 420,
  "made": 421,
  "could": 422,
  "beyond": 423,
  "relevant": 424,
  "area": 425,
  "checked": 426,
  "[[4": 427,
  "2]]": 428,
  "them": 429,
  "shown": 430,
  "xi": 433,
  "yi": 434,
  "pairs": 435,
  "breadth": 436,
  "first": 437,
  "board": 438,
  "five": 439,
  "tiles": 440,
  "labeled": 441,
  "represented": 442,
  "consists": 443,
  "choosing": 444,
  "directionally": 445,
  "adjacent": 446,
  "swapping": 447,
  "state": 448,
  "solved": 449,
  "puzzle": 450,
  "least": 451,
  "moves": 452,
  "required": 453,
  "impossible": 454,
  "5]]": 455,
  "swap": 456,
  "[5": 457,
  "3]]": 458,
  "smallest": 459,
  "solves": 460,
  "path:": 461,
  "0:": 462,
  "4:": 463,
  "5:": 464,
  "board[i]": 465,
  "board[i][j]": 466,
  "filled": 467,
  "negative": 468,
  "numbers": 469,
  "minimizes": 470,
  "its": 471,
  "because": 472,
  "→": 473,
  "6]]": 474,
  "depth": 477,
  "graph": 478,
  "heap": 479,
  "priority": 480,
  "queue": 481,
  "shortest": 482,
  "cities": 483,
  "connected": 484,
  "flights": 485,
  "flights[i]": 486,
  "[fromi": 487,
  "toi": 488,
  "pricei]": 489,
  "indicates": 490,
  "flight": 491,
  "city": 492,
  "fromi": 493,
  "pricei": 494,
  "src": 495,
  "dst": 496,
  "cheapest": 497,
  "stops": 498,
  "route": 499,
  "100]": 500,
  "600]": 501,
  "200]]": 502,
  "optimal": 504,
  "stop": 505,
  "red": 506,
  "cheaper": 508,
  "invalid": 509,
  "uses": 510,
  "500]]": 511,
  "/": 512,
  "math": 513,
  "good": 514,
  "rotating": 515,
  "digit": 516,
  "individually": 517,
  "degrees": 519,
  "rotated": 520,
  "choose": 521,
  "leave": 522,
  "alone": 523,
  "remains": 524,
  "rotation": 525,
  "example:": 526,
  "rotate": 527,
  "themselves": 528,
  "case": 529,
  "they": 530,
  "direction": 531,
  "words": 532,
  "gets": 533,
  "mirrored": 534,
  "rest": 535,
  "do": 536,
  "become": 537,
  "n]": 538,
  "10]": 539,
  ":": 540,
  "remain": 541,
  "unchanged": 542,
  "types": 543,
  "tiles:": 544,
  "domino": 545,
  "shape": 546,
  "tromino": 547,
  "these": 548,
  "shapes": 549,
  "tile": 550,
  "tiling": 551,
  "covered": 552,
  "tilings": 553,
  "exactly": 554,
  "squares": 555,
  "occupied": 556,
  "trie": 557,
  "sorting": 558,
  "words[i]": 559,
  "new": 560,
  "original": 561,
  "without": 562,
  "changing": 563,
  "relative": 564,
  "remaining": 565,
  "ace": 566,
  "abcde": 567,
  "acd": 568,
  "]": 569,
  "s:": 570,
  "dsahjpjauf": 571,
  "ahjpjau": 572,
  "ja": 573,
  "ahbwzgqnuk": 574,
  "tnmlanowax": 575,
  "stack": 576,
  "glasses": 577,
  "pyramid": 578,
  "row": 579,
  "glass": 580,
  "second": 581,
  "until": 582,
  "100th": 583,
  "holds": 584,
  "cupof": 585,
  "champagne": 586,
  "poured": 587,
  "topmost": 588,
  "full": 589,
  "excess": 590,
  "liquid": 591,
  "fall": 592,
  "equally": 593,
  "immediately": 594,
  "those": 595,
  "cup": 596,
  "cups": 597,
  "half": 598,
  "now": 599,
  "third": 600,
  "outside": 601,
  "quarter": 602,
  "pictured": 603,
  "below": 604,
  "pouring": 605,
  "how": 606,
  "jth": 607,
  "j": 608,
  "indexed": 609,
  "query_row": 610,
  "query_glass": 611,
  "00000": 612,
  "champange": 613,
  "tower": 614,
  "share": 616,
  "<=poured": 620,
  "query_row<": 621,
  "allowed": 622,
  "8]": 623,
  "obtain": 624,
  "needed": 625,
  "operations": 626,
  "strictly": 627,
  "increasing": 628,
  "test": 629,
  "cases": 630,
  "always": 631,
  "makes": 632,
  "arr": 633,
  "arr[0]": 634,
  "arr[1]": 635,
  "arr[2]": 636,
  "arr[arr": 637,
  "nums1[3]": 638,
  "nums2[3]": 639,
  "are:": 640,
  "average": 642,
  "otherwise": 643,
  "elements": 644,
  "split": 645,
  "probability": 647,
  "statistics": 648,
  "soup:": 649,
  "type": 650,
  "ml": 651,
  "soup": 652,
  "kinds": 653,
  "serve": 654,
  "give": 657,
  "someone": 658,
  "longer": 659,
  "volume": 660,
  "enough": 661,
  "much": 662,
  "quantity": 663,
  "used": 664,
  "within": 665,
  "actual": 666,
  "accepted": 667,
  "fourth": 669,
  "becoming": 670,
  "prefix": 673,
  "partition": 674,
  "subarrays": 675,
  "score": 676,
  "averages": 677,
  "use": 678,
  "necessarily": 679,
  "partitions": 680,
  "[9": 681,
  "best": 682,
  "choice": 683,
  "[9]": 684,
  "partitioned": 685,
  "lead": 686,
  "worse": 688,
  "car": 689,
  "starts": 690,
  "speed": 691,
  "+1": 692,
  "infinite": 693,
  "line": 694,
  "go": 695,
  "positions": 696,
  "drives": 697,
  "automatically": 698,
  "according": 699,
  "instructions": 700,
  "accelerate": 701,
  "r": 702,
  "reverse": 703,
  "instruction": 704,
  "following:": 705,
  "+=": 706,
  "*=": 707,
  "positive": 708,
  "stays": 709,
  "commands": 710,
  "aar": 711,
  "goes": 712,
  "target": 713,
  "aaara": 714,
  "climbing": 715,
  "distinct": 716,
  "arr[i]": 718,
  "greater": 719,
  "tree": 720,
  "using": 721,
  "leaf": 722,
  "node": 723,
  "product": 724,
  "children": 725,
  "trees": 726,
  "trees:": 727,
  "[4]": 728,
  "[5]": 729,
  "[10]": 730,
  "5]": 731,
  "define": 732,
  "countuniquechars": 733,
  "returns": 734,
  "ins": 735,
  "calling": 736,
  "leetcode": 737,
  "l": 738,
  "o": 739,
  "appear": 740,
  "fits": 741,
  "notice": 743,
  "substrings": 744,
  "count": 745,
  "ones": 746,
  "abc": 747,
  "bc": 748,
  "composed": 749,
  "lengths": 750,
  "uppercase": 752,
  "undirected": 753,
  "nodes": 754,
  "edges": 755,
  "edges[i]": 756,
  "[ai": 757,
  "bi]": 758,
  "edge": 759,
  "answer[i]": 760,
  "distances": 761,
  "[8": 762,
  "see": 763,
  "dist": 764,
  "equals": 765,
  "hence": 766,
  "answer[0]": 767,
  "[0]": 768,
  "represents": 769,
  "alice": 770,
  "plays": 771,
  "game": 772,
  "loosely": 773,
  "based": 774,
  "card": 775,
  "draws": 777,
  "she": 778,
  "draw": 779,
  "gains": 780,
  "randomly": 781,
  "maxpts]": 782,
  "maxpts": 783,
  "independent": 784,
  "outcomes": 785,
  "probabilities": 786,
  "drawing": 787,
  "fewer": 788,
  "considered": 789,
  "possibilities": 791,
  "dominoes": 793,
  "place": 794,
  "vertically": 795,
  "upright": 796,
  "beginning": 797,
  "push": 798,
  "falling": 799,
  "pushes": 800,
  "similarly": 801,
  "their": 802,
  "standing": 803,
  "vertical": 804,
  "sides": 805,
  "still": 806,
  "due": 807,
  "balance": 808,
  "forces": 809,
  "purposes": 810,
  "question": 811,
  "consider": 812,
  "expends": 813,
  "additional": 814,
  "force": 815,
  "already": 816,
  "fallen": 817,
  "initial": 818,
  "dominoes[i]": 819,
  "been": 820,
  "pushed": 821,
  "final": 822,
  "rr": 823,
  "lr": 824,
  "ll": 825,
  "llrrll": 826,
  "enumeration": 827,
  "recall": 828,
  "mountain": 829,
  "if:": 830,
  ">=": 831,
  "exists": 832,
  "that:": 833,
  "arr[i": 834,
  "follow": 835,
  "up:": 836,
  "solve": 837,
  "graph[i]": 838,
  "list": 839,
  "visits": 840,
  "revisit": 841,
  "reuse": 842,
  "[0]]": 843,
  "[[1]": 844,
  "<n": 845,
  "contain": 846,
  "graph[a]": 847,
  "graph[b]": 848,
  "travels": 849,
  "destination": 850,
  "miles": 851,
  "east": 852,
  "gas": 853,
  "stations": 854,
  "stations[i]": 855,
  "[positioni": 856,
  "fueli]": 857,
  "station": 858,
  "positioni": 859,
  "fueli": 860,
  "liters": 861,
  "tank": 862,
  "startfuel": 863,
  "fuel": 864,
  "liter": 865,
  "per": 866,
  "mile": 867,
  "reaches": 868,
  "refuel": 869,
  "transferring": 870,
  "refueling": 871,
  "arrived": 872,
  "[[10": 873,
  "100]]": 874,
  "60]": 875,
  "[20": 876,
  "30]": 877,
  "[30": 878,
  "[60": 879,
  "40]]": 880,
  "drive": 881,
  "expending": 882,
  "positioni+1": 884,
  "x1": 885,
  "x2": 886,
  "xn": 887,
  "fibonacci": 888,
  "xi+1": 889,
  "xi+2": 890,
  "forming": 891,
  "exist": 892,
  "derived": 893,
  "another": 894,
  "including": 895,
  "like:": 896,
  "18]": 899,
  "12]": 900,
  "14]": 901,
  "[7": 902,
  "theory": 903,
  "bob": 904,
  "play": 905,
  "piles": 906,
  "stones": 907,
  "arranged": 908,
  "pile": 909,
  "piles[i]": 910,
  "objective": 911,
  "across": 912,
  "odd": 913,
  "ties": 914,
  "turns": 915,
  "continues": 916,
  "person": 917,
  "wins": 918,
  "assuming": 919,
  "optimally": 920,
  "last": 921,
  "say": 922,
  "win": 923,
  "demonstrated": 924,
  "taking": 925,
  "was": 926,
  "winning": 927,
  "word1": 928,
  "word2": 929,
  "convert": 930,
  "permitted": 931,
  "word:": 932,
  "insert": 933,
  "replace": 934,
  "horse": 935,
  "ros": 936,
  "rorse": 937,
  "h": 938,
  "rose": 939,
  "remove": 940,
  "intention": 941,
  "execution": 942,
  "inention": 943,
  "enention": 944,
  "exention": 945,
  "exection": 946,
  "u": 947,
  "group": 948,
  "members": 949,
  "various": 950,
  "crimes": 951,
  "commit": 952,
  "crime": 953,
  "generates": 954,
  "profit[i]": 955,
  "requires": 956,
  "group[i]": 957,
  "participate": 958,
  "member": 959,
  "participates": 960,
  "call": 961,
  "profitable": 962,
  "scheme": 963,
  "subset": 964,
  "minprofit": 965,
  "participating": 966,
  "schemes": 967,
  "chosen": 968,
  "[6": 969,
  "long": 970,
  "schemes:": 971,
  "identical": 972,
  "eggs": 973,
  "access": 974,
  "building": 975,
  "floors": 976,
  "know": 977,
  "f": 978,
  "egg": 979,
  "dropped": 980,
  "break": 981,
  "unbroken": 982,
  "drop": 983,
  "breaks": 984,
  "however": 985,
  "future": 986,
  "determine": 987,
  "certainty": 988,
  "what": 989,
  "val": 990,
  "root": 991,
  "null": 992,
  "bitwise": 993,
  "ors": 994,
  "contiguous": 995,
  "result:": 996,
  "[1]": 997,
  "yield": 998,
  "results": 999,
  "sorted": 1000,
  "decreasing": 1001,
  "write": 1002,
  "digits[i]": 1003,
  "written": 1006,
  "six": 1023,
  "seven": 1025,
  "eight": 1027,
  "nine": 1029,
  "indigits": 1030,
  "innon": 1031,
  "either:": 1032,
  "permutation": 1033,
  "perm": 1034,
  "called": 1035,
  "i:": 1036,
  "perm[i]": 1037,
  "perm[i": 1038,
  "permutations": 1039,
  "did": 1040,
  "monotonic": 1041,
  "min": 1042,
  "ranges": 1043,
  "minimums": 1044,
  "[11": 1045,
  "topological": 1049,
  "sort": 1050,
  "played": 1051,
  "players": 1052,
  "mouse": 1053,
  "cat": 1054,
  "who": 1055,
  "alternate": 1056,
  "follows:": 1057,
  "hole": 1058,
  "travel": 1059,
  "oneedge": 1060,
  "meets": 1061,
  "graph[1]": 1062,
  "additionally": 1063,
  "threeways:": 1064,
  "ever": 1065,
  "occupies": 1066,
  "andit": 1067,
  "1if": 1068,
  "2if": 1069,
  "0if": 1070,
  "[[2": 1071,
  "1<=": 1072,
  "graph[i][j]": 1073,
  "conquer": 1074,
  "circular": 1075,
  "connects": 1076,
  "formally": 1077,
  "next": 1078,
  "nums[": 1079,
  "%": 1080,
  "fixed": 1081,
  "buffer": 1082,
  "nums[i": 1083,
  "nums[j]": 1084,
  "k1": 1085,
  "k2": 1086,
  "combinatorics": 1087,
  "music": 1088,
  "songs": 1089,
  "listen": 1090,
  "goal": 1091,
  "avoid": 1092,
  "boredom": 1093,
  "create": 1094,
  "playlist": 1095,
  "song": 1096,
  "playlists": 1097,
  "playlists:": 1098,
  "rows": 1099,
  "colsbinary": 1100,
  "rectangle": 1101,
  "[[": 1102,
  "]]": 1103,
  "maximal": 1104,
  "picture": 1105,
  "cols": 1106,
  "matrix[i]": 1107,
  "matrix[i][j]": 1108,
  "monotone": 1109,
  "possibly": 1110,
  "followed": 1111,
  "flip": 1112,
  "flips": 1113,
  "00110": 1114,
  "00111": 1115,
  "010110": 1116,
  "011111": 1117,
  "alternatively": 1118,
  "000111": 1119,
  "00011000": 1120,
  "00000000": 1121,
  "chooses": 1122,
  "directly": 1123,
  "diagonally": 1124,
  "left/right": 1125,
  "specifically": 1126,
  "col": 1127,
  "9]]": 1128,
  "57]": 1130,
  "chess": 1133,
  "knight": 1134,
  "movement": 1135,
  "horizontally": 1136,
  "movements": 1137,
  "diagram:": 1138,
  "indicated": 1139,
  "diagram": 1140,
  "phone": 1141,
  "pad": 1142,
  "stand": 1143,
  "numeric": 1144,
  "blue": 1145,
  "dial": 1146,
  "jumps": 1147,
  "placing": 1148,
  "sufficient": 1149,
  "[04": 1150,
  "06": 1151,
  "94]": 1162,
  "please": 1165,
  "care": 1166,
  "mod": 1167,
  "formed": 1168,
  "disturbing": 1169,
  "aec": 1170,
  "ac": 1171,
  "ba": 1172,
  "aaa": 1173,
  "assume": 1175,
  "alex": 1176,
  "loves": 1177,
  "alexlovesleetcode": 1178,
  "catg": 1179,
  "ctaagt": 1180,
  "gcta": 1181,
  "ttca": 1182,
  "atgcatc": 1183,
  "gctaagttcatgcatc": 1184,
  "installing": 1185,
  "billboard": 1186,
  "height": 1187,
  "steel": 1188,
  "supports": 1189,
  "side": 1190,
  "collection": 1191,
  "rods": 1192,
  "welded": 1193,
  "together": 1194,
  "weld": 1195,
  "installation": 1196,
  "6]": 1197,
  "disjoint": 1198,
  "{1": 1199,
  "3}": 1200,
  "{6}": 1201,
  "{2": 1202,
  "5}": 1203,
  "{4": 1204,
  "6}": 1205,
  "supported": 1206,
  "rods[i]": 1207,
  "strs": 1208,
  "deletion": 1209,
  "abcdef": 1210,
  "uvwxyz": 1211,
  "{0": 1212,
  "deletions": 1213,
  "bef": 1214,
  "vyz": 1215,
  "suppose": 1216,
  "chose": 1217,
  "set": 1218,
  "lexicographic": 1219,
  "strs[0][0]": 1220,
  "strs[0][1]": 1221,
  "strs[0][strs[0]": 1222,
  "strs[1][0]": 1223,
  "strs[1][1]": 1224,
  "strs[1][strs[1]": 1225,
  "babca": 1226,
  "bbazb": 1227,
  "columns": 1228,
  "az": 1229,
  "ie": 1230,
  "strs[0]": 1231,
  "strs[1]": 1232,
  "edcba": 1233,
  "lexicographically": 1234,
  "ghi": 1235,
  "def": 1236,
  "strs[i]": 1237,
  "form": 1238,
  "op1": 1239,
  "op2": 1240,
  "op3": 1241,
  "operator": 1242,
  "etc": 1243,
  "addition": 1244,
  "subtraction": 1245,
  "multiplication": 1246,
  "division": 1247,
  "might": 1248,
  "writing": 1249,
  "adhere": 1250,
  "conventions:": 1251,
  "rational": 1252,
  "parentheses": 1253,
  "placed": 1254,
  "anywhere": 1255,
  "usual": 1256,
  "happen": 1257,
  "unary": 1258,
  "negation": 1259,
  "operators": 1260,
  "install": 1264,
  "cameras": 1265,
  "camera": 1266,
  "monitor": 1267,
  "parent": 1268,
  "itself": 1269,
  "immediate": 1270,
  "image": 1271,
  "shows": 1272,
  "configurations": 1273,
  "placement": 1274,
  "1000]": 1275,
  "ordered": 1276,
  "series": 1277,
  "1st": 1278,
  "3rd": 1279,
  "5th": 1280,
  "numbered": 1281,
  "2nd": 1282,
  "4th": 1283,
  "6th": 1284,
  "jump": 1285,
  "forward": 1286,
  "way:": 1287,
  "arr[j]": 1288,
  "legal": 1289,
  "jumping": 1290,
  "15]": 1291,
  "our": 1292,
  "among": 1293,
  "arr[3]": 1294,
  "arr[4]": 1295,
  "reached": 1296,
  "[arr[1]": 1297,
  "arr[4]]": 1298,
  "[arr[2]": 1299,
  "smaller": 1300,
  "[arr[3]": 1301,
  "similar": 1302,
  "manner": 1303,
  "deduce": 1304,
  "anymore": 1305,
  "scramble": 1306,
  "algorithm:": 1307,
  "random": 1308,
  "y": 1309,
  "randomlydecide": 1310,
  "keep": 1311,
  "apply": 1312,
  "recursively": 1313,
  "scrambled": 1314,
  "great": 1315,
  "rgeat": 1316,
  "scenario": 1317,
  "applied": 1318,
  "is:": 1319,
  "gr/eat": 1320,
  "//": 1321,
  "decision": 1322,
  "g/r": 1323,
  "e/at": 1324,
  "algorithm": 1325,
  "r/g": 1326,
  "e/": 1327,
  "a/t": 1328,
  "result": 1329,
  "led": 1330,
  "caebd": 1331,
  "size": 1332,
  "turbulent": 1333,
  "comparison": 1334,
  "pair": 1335,
  "[arr[i]": 1336,
  "arr[j]]": 1337,
  "said": 1338,
  "j:": 1339,
  "arr[k]": 1340,
  "arr[k": 1341,
  "arr[5]": 1342,
  "16]": 1343,
  "[100]": 1344,
  "planned": 1345,
  "train": 1346,
  "traveling": 1347,
  "year": 1348,
  "advance": 1349,
  "days": 1350,
  "tickets": 1352,
  "sold": 1353,
  "ways:": 1354,
  "costs[0]": 1355,
  "dollars": 1356,
  "costs[1]": 1357,
  "costs[2]": 1358,
  "passes": 1359,
  "allow": 1360,
  "consecutive": 1361,
  "days:": 1362,
  "costs": 1363,
  "lets": 1364,
  "plan:": 1365,
  "bought": 1366,
  "$2": 1367,
  "$7": 1368,
  "spent": 1369,
  "$11": 1370,
  "31]": 1371,
  "$15": 1372,
  "$17": 1373,
  "days[i]": 1374,
  "costs[i]": 1375,
  "squareful": 1376,
  "perfect": 1377,
  "perm1": 1378,
  "perm2": 1379,
  "perm1[i]": 1380,
  "perm2[i]": 1381,
  "17]": 1382,
  "[17": 1383,
  "stones[i]": 1384,
  "merging": 1385,
  "merge": 1386,
  "task": 1387,
  "[17]": 1388,
  "atleast": 1389,
  "values[i]": 1396,
  "sightseeing": 1397,
  "spot": 1398,
  "spots": 1399,
  "distance": 1400,
  "values[j]": 1401,
  "minus": 1402,
  "video": 1403,
  "clips": 1404,
  "sporting": 1405,
  "event": 1406,
  "lasted": 1407,
  "seconds": 1408,
  "overlapping": 1409,
  "varying": 1410,
  "clip": 1411,
  "described": 1412,
  "clips[i]": 1413,
  "[starti": 1414,
  "endi]": 1415,
  "starti": 1416,
  "ended": 1417,
  "endi": 1418,
  "cut": 1419,
  "segments": 1420,
  "freely": 1421,
  "time]": 1422,
  "reconstruct": 1423,
  "brainteaser": 1424,
  "playing": 1425,
  "chalkboard": 1426,
  "consisting": 1427,
  "of:": 1428,
  "replacing": 1429,
  "lose": 1430,
  "arithmetic": 1431,
  "seq": 1432,
  "seq[i": 1433,
  "seq[i]": 1434,
  "whole": 1435,
  "firstlen": 1436,
  "secondlen": 1437,
  "occur": 1438,
  "part": 1439,
  "intercepted": 1440,
  "secret": 1441,
  "message": 1442,
  "encoded": 1443,
  "decoded": 1444,
  "via": 1445,
  "mapping:": 1446,
  "z": 1448,
  "decoding": 1449,
  "realize": 1450,
  "decode": 1451,
  "codes": 1452,
  "vs": 1453,
  "into:": 1455,
  "aajf": 1456,
  "grouping": 1457,
  "kjf": 1458,
  "code": 1459,
  "bz": 1461,
  "vf": 1462,
  "bbf": 1463,
  "mapped": 1464,
  "leading": 1465,
  "encoding": 1466,
  "separate": 1467,
  "horizontal": 1468,
  "lines": 1469,
  "connecting": 1470,
  "lines:": 1471,
  "straight": 1472,
  "nums2[j]": 1473,
  "intersect": 1474,
  "endpoints": 1475,
  "belong": 1476,
  "uncrossed": 1477,
  "nums1[1]": 1478,
  "nums2[2]": 1479,
  "nums1[2]=2": 1480,
  "nums2[1]=2": 1481,
  "convex": 1482,
  "sided": 1483,
  "polygon": 1484,
  "vertex": 1485,
  "clockwise": 1486,
  "triangulation": 1487,
  "process": 1488,
  "triangles": 1489,
  "vertices": 1490,
  "triangle": 1491,
  "triangulate": 1492,
  "weight": 1493,
  "weights": 1494,
  "triangulated": 1495,
  "triangulations": 1497,
  "scores:": 1498,
  "3*7*5": 1499,
  "4*5*7": 1500,
  "3*4*5": 1502,
  "3*4*7": 1503,
  "1*1*3": 1504,
  "1*1*4": 1505,
  "1*1*5": 1506,
  "1*1*1": 1507,
  "partitioning": 1508,
  "changed": 1509,
  "[15": 1511,
  "word": 1512,
  "worda": 1513,
  "predecessor": 1514,
  "wordb": 1515,
  "letter": 1516,
  "abac": 1517,
  "cba": 1518,
  "bcad": 1519,
  "chain": 1520,
  "[word1": 1521,
  "wordk]": 1522,
  "word3": 1523,
  "trivially": 1524,
  "bca": 1525,
  "bda": 1526,
  "bdca": 1527,
  "chains": 1528,
  "xbc": 1529,
  "pcxbcf": 1530,
  "xb": 1531,
  "cxbc": 1532,
  "pcxbc": 1533,
  "put": 1534,
  "abcd": 1535,
  "dbqca": 1536,
  "trivial": 1537,
  "ordering": 1538,
  "stone": 1539,
  "smash": 1540,
  "destroyed": 1541,
  "combine": 1542,
  "converts": 1543,
  "[31": 1544,
  "40]": 1545,
  "str1": 1546,
  "str2": 1547,
  "cab": 1548,
  "cabac": 1549,
  "provided": 1550,
  "satisfies": 1551,
  "properties": 1552,
  "aaaaaaaa": 1553,
  "books": 1554,
  "books[i]": 1555,
  "[thicknessi": 1556,
  "heighti]": 1557,
  "thickness": 1558,
  "book": 1559,
  "shelfwidth": 1560,
  "onto": 1561,
  "bookcase": 1562,
  "shelves": 1563,
  "width": 1564,
  "shelf": 1565,
  "build": 1566,
  "level": 1567,
  "increased": 1568,
  "repeat": 1569,
  "fifth": 1570,
  "bookshelf": 1571,
  "heights": 1572,
  "thicknessi": 1573,
  "heighti": 1574,
  "project": 1575,
  "skills": 1576,
  "req_skills": 1577,
  "people": 1578,
  "people[i]": 1579,
  "team:": 1580,
  "skill": 1581,
  "team": 1582,
  "represent": 1583,
  "teams": 1584,
  "people[0]": 1585,
  "people[1]": 1586,
  "people[3]": 1587,
  "java": 1588,
  "nodejs": 1589,
  "reactjs": 1590,
  "algorithms": 1591,
  "csharp": 1592,
  "aws": 1593,
  "req_skills[i]": 1594,
  "people[i][j]": 1595,
  "correspond": 1596,
  "traversal": 1597,
  "subtree": 1598,
  "11]": 1600,
  "signed": 1601,
  "tribonacci": 1602,
  "tn": 1603,
  "t0": 1604,
  "t1": 1605,
  "t2": 1606,
  "tn+3": 1607,
  "tn+1": 1608,
  "tn+2": 1609,
  "t_3": 1610,
  "t_4": 1611,
  "fit": 1613,
  "2^31": 1614,
  "structurally": 1615,
  "bst": 1616,
  "[[1]]": 1617,
  "2d": 1618,
  "0s": 1619,
  "1s": 1620,
  "inthe": 1621,
  "squaresubgrid": 1622,
  "border": 1623,
  "subgriddoesn": 1624,
  "grid[0]": 1625,
  "continue": 1626,
  "games": 1627,
  "2m": 1628,
  "max": 1629,
  "taken": 1630,
  "larger": 1631,
  "piles[i]<=": 1632,
  "text1": 1633,
  "text2": 1634,
  "common": 1635,
  "text": 1636,
  "subtext1": 1637,
  "subtext2": 1638,
  "subtextk": 1639,
  "subtexti": 1640,
  "concatenation": 1641,
  "ghiabcdefhelloadamhelloabcdefghi": 1642,
  "hello": 1643,
  "adam": 1644,
  "merchant": 1645,
  "antaprezatepzapreanta": 1646,
  "nt": 1647,
  "pre": 1648,
  "za": 1649,
  "tep": 1650,
  "dice": 1651,
  "faces": 1652,
  "kn": 1653,
  "roll": 1654,
  "face": 1655,
  "throw": 1656,
  "die": 1657,
  "7:": 1658,
  "1+6": 1659,
  "2+5": 1660,
  "3+4": 1661,
  "4+3": 1662,
  "5+2": 1663,
  "6+1": 1664,
  "returned": 1666,
  "gridcontaining": 1667,
  "where0": 1668,
  "waterand": 1669,
  "land": 1670,
  "water": 1671,
  "nearest": 1672,
  "maximized": 1673,
  "problem": 1674,
  "manhattan": 1675,
  "distance:the": 1676,
  "x0": 1677,
  "y0": 1678,
  "y1": 1679,
  "|x0": 1680,
  "x1|": 1681,
  "|y0": 1682,
  "y1|": 1683,
  "far": 1684,
  "n<=": 1685,
  "grid[i][j]is": 1686,
  "emptysubarray": 1687,
  "optionally": 1688,
  "thesum": 1689,
  "needs": 1690,
  "thus": 1691,
  "explanation:the": 1692,
  "arraysarr1": 1693,
  "arr2": 1694,
  "neededto": 1695,
  "arr1": 1696,
  "indices0": 1697,
  "<=i": 1698,
  "lengthand0": 1699,
  "lengthand": 1700,
  "assignmentarr1[i]": 1701,
  "arr2[j]": 1702,
  "makearr1strictly": 1703,
  "arr1[i]": 1704,
  "arr2[i]": 1705,
  "10^9": 1706,
  "modify": 1707,
  "modified": 1708,
  "sub": 1709,
  "difference": 1710,
  "rules:": 1711,
  "lower": 1712,
  "vowel": 1713,
  "answermay": 1714,
  "modulo10^9": 1715,
  "ae": 1716,
  "ea": 1717,
  "ei": 1718,
  "ia": 1719,
  "io": 1720,
  "iu": 1721,
  "oi": 1722,
  "ou": 1723,
  "ua": 1724,
  "10^4": 1726,
  "simulator": 1727,
  "introduced": 1728,
  "constraint": 1729,
  "generator": 1730,
  "rollmax[i]": 1731,
  "rollmax": 1732,
  "exact": 1733,
  "rolls": 1734,
  "differs": 1735,
  "constraints": 1736,
  "combinations": 1737,
  "looking": 1738,
  "consecutively": 1739,
  "passengers": 1741,
  "airplane": 1742,
  "seats": 1743,
  "passenger": 1744,
  "lost": 1745,
  "ticket": 1746,
  "picks": 1747,
  "seat": 1748,
  "will:": 1749,
  "available": 1750,
  "nth": 1751,
  "his": 1752,
  "jobs": 1753,
  "job": 1754,
  "scheduled": 1755,
  "done": 1756,
  "starttime[i]": 1757,
  "endtime[i]": 1758,
  "obtaining": 1759,
  "re": 1760,
  "starttime": 1761,
  "endtime": 1762,
  "ends": 1763,
  "able": 1764,
  "[50": 1765,
  "70]": 1766,
  "3]+[3": 1768,
  "singleletters": 1771,
  "scoreof": 1772,
  "twoor": 1773,
  "necessary": 1774,
  "byscore[0]": 1775,
  "score[1]": 1776,
  "score[25]": 1777,
  "dog": 1778,
  "dad": 1779,
  "g": 1780,
  "a=1": 1782,
  "c=9": 1783,
  "d=5": 1784,
  "g=3": 1785,
  "o=2": 1786,
  "5+1+5": 1787,
  "3+2+2+5": 1788,
  "xxxz": 1789,
  "ax": 1790,
  "bx": 1791,
  "cx": 1792,
  "a=4": 1793,
  "b=4": 1794,
  "c=4": 1795,
  "x=5": 1796,
  "z=10": 1797,
  "4+5": 1798,
  "letters[i]": 1799,
  "==26": 1800,
  "score[i]": 1801,
  "letters[i]contains": 1802,
  "divisible": 1803,
  "pointer": 1804,
  "arrlen": 1805,
  "stay": 1806,
  "differents": 1807,
  "zeros": 1809,
  "submatrices": 1810,
  "arr[i][j]": 1812,
  "change": 1813,
  "palindrome": 1814,
  "minimal": 1815,
  "explanation:you": 1816,
  "aabbc": 1817,
  "shifts": 1818,
  "column": 1819,
  "is[1": 1820,
  "is13": 1821,
  "[[7]]": 1822,
  "s3": 1823,
  "whether": 1824,
  "interleaving": 1825,
  "configuration": 1826,
  "divided": 1827,
  "sn": 1828,
  "tm": 1829,
  "|n": 1830,
  "m|": 1831,
  "t3": 1832,
  "aabcc": 1833,
  "dbbca": 1834,
  "aadbbcbcac": 1835,
  "dbbc": 1836,
  "splits": 1837,
  "aadbbbaccc": 1838,
  "interleave": 1839,
  "memory": 1840,
  "boardof": 1841,
  "needto": 1842,
  "character1": 1843,
  "integers:": 1844,
  "return[0": 1845,
  "e23": 1846,
  "2x2": 1847,
  "12s": 1848,
  "e12": 1849,
  "1x1": 1850,
  "21s": 1851,
  "e11": 1852,
  "xxx": 1853,
  "11s": 1854,
  "spalindrome": 1855,
  "apalindrome": 1856,
  "stringis": 1857,
  "reads": 1858,
  "backward": 1859,
  "well": 1860,
  "zzazz": 1861,
  "insertions": 1862,
  "mbadm": 1863,
  "mbdadbm": 1864,
  "mdbabdm": 1865,
  "inserting": 1866,
  "leetcodocteel": 1867,
  "keyboard": 1868,
  "layout": 1869,
  "plane": 1870,
  "coordinate": 1871,
  "fingers": 1872,
  "coordinates": 1873,
  "y2": 1874,
  "|x1": 1875,
  "x2|": 1876,
  "|y1": 1877,
  "y2|": 1878,
  "free": 1879,
  "towards": 1880,
  "cake": 1881,
  "finger": 1882,
  "happy": 1883,
  "dimensional": 1884,
  "garden": 1885,
  "thelength": 1886,
  "taps": 1887,
  "ranges[i]": 1888,
  "th": 1889,
  "tap": 1890,
  "[i": 1891,
  "ranges[i]]": 1892,
  "open": 1893,
  "watered": 1894,
  "interval": 1895,
  "opening": 1896,
  "activate": 1897,
  "weighti]": 1898,
  "bidirectional": 1899,
  "weighted": 1900,
  "distancethreshold": 1901,
  "reachable": 1902,
  "greatest": 1903,
  "figure": 1904,
  "describes": 1905,
  "neighboring": 1906,
  "[city": 1907,
  "weighti": 1908,
  "schedule": 1909,
  "dependent": 1910,
  "work": 1911,
  "finish": 1912,
  "difficulty": 1913,
  "difficulties": 1914,
  "jobdifficulty": 1915,
  "jobdifficulty[i]": 1916,
  "ofintegers": 1917,
  "index:": 1918,
  "where:i": 1919,
  "<x": 1920,
  "jif": 1921,
  "indicesyou": 1922,
  "visit": 1923,
  "indicies": 1924,
  "m*": 1925,
  "nmatrix": 1926,
  "seatsthat": 1927,
  "distributionsin": 1928,
  "classroom": 1929,
  "seatisbroken": 1930,
  "denoted": 1931,
  "#": 1932,
  "students": 1933,
  "sitting": 1934,
  "upper": 1935,
  "he": 1936,
  "student": 1937,
  "sittingdirectly": 1938,
  "front": 1939,
  "behind": 1940,
  "him": 1941,
  "exam": 1942,
  "togetherwithout": 1943,
  "cheating": 1944,
  "being": 1945,
  "condition": 1946,
  "teacher": 1947,
  "don": 1948,
  "cheat": 1949,
  "seatscontains": 1950,
  "==seats": 1951,
  "==seats[i]": 1952,
  "orders": 1953,
  "pickup": 1954,
  "delivery": 1955,
  "service": 1956,
  "pickup/delivery": 1957,
  "ofpickup": 1958,
  "p1": 1959,
  "d1": 1960,
  "orders:": 1961,
  "p2": 1962,
  "d2": 1963,
  "concatenating": 1965,
  "data": 1966,
  "unnecessary": 1967,
  "generate": 1970,
  "rabbbit": 1971,
  "rabbit": 1972,
  "babgbag": 1973,
  "bag": 1974,
  "zigzag": 1975,
  "follow:": 1976,
  "current": 1977,
  "child": 1978,
  "visited": 1979,
  "104]": 1980,
  "keys": 1981,
  "key": 1982,
  "subtrees": 1983,
  "negatives": 1984,
  "power": 1985,
  "transform": 1986,
  "steps:": 1987,
  "lo": 1988,
  "hi": 1989,
  "[lo": 1990,
  "hi]": 1991,
  "ascending": 1992,
  "kth": 1993,
  "[12": 1994,
  "corresponding": 1995,
  "[16": 1996,
  "pizza": 1997,
  "3n": 1998,
  "slices": 1999,
  "friends": 2000,
  "slice": 2001,
  "friend": 2002,
  "anti": 2003,
  "pizzas": 2004,
  "sizes": 2005,
  "finally": 2006,
  "partners": 2007,
  "slices[i]": 2008,
  "segment": 2009,
  "soldiers": 2010,
  "soldier": 2011,
  "assigned": 2012,
  "rating": 2013,
  "amongst": 2014,
  "rating[i]": 2015,
  "rating[j]": 2016,
  "rating[k]": 2017,
  "conditions": 2018,
  "evil": 2019,
  "alphabetically": 2020,
  "huge": 2021,
  "da": 2022,
  "ad": 2023,
  "ca": 2024,
  "cd": 2025,
  "cz": 2026,
  "leetgoes": 2027,
  "gx": 2028,
  "gz": 2029,
  "chef": 2030,
  "satisfaction": 2031,
  "dishes": 2032,
  "cook": 2033,
  "dish": 2034,
  "unit": 2035,
  "coefficient": 2036,
  "multiplied": 2037,
  "time[i]": 2038,
  "satisfaction[i]": 2039,
  "preparing": 2040,
  "amount": 2041,
  "prepared": 2042,
  "discard": 2043,
  "removing": 2044,
  "1*1": 2045,
  "0*2": 2046,
  "5*3": 2047,
  "2*1": 2048,
  "3*2": 2049,
  "4*3": 2050,
  "several": 2051,
  "associated": 2052,
  "stonevalue": 2053,
  "highest": 2054,
  "winner": 2055,
  "tie": 2056,
  "her": 2057,
  "remember": 2058,
  "decided": 2059,
  "stonevalue[i]": 2060,
  "paint": 2061,
  "colors:": 2062,
  "yellow": 2063,
  "green": 2064,
  "making": 2065,
  "sure": 2066,
  "color": 2067,
  "grow": 2068,
  "computed": 2069,
  "program": 2071,
  "supposed": 2072,
  "print": 2073,
  "forgot": 2074,
  "whitespaces": 2075,
  "printed": 2076,
  "k]": 2077,
  "mentioned": 2078,
  "[1000]": 2080,
  "[1317]": 2082,
  "[131": 2083,
  "[13": 2084,
  "317]": 2085,
  "numrows": 2086,
  "pascal": 2087,
  "shown:": 2088,
  "properties:": 2089,
  "search_cost": 2090,
  "satisfy": 2091,
  "satisfied": 2092,
  "leaving": 2093,
  "hats": 2094,
  "hats[i]": 2095,
  "preferred": 2096,
  "wear": 2097,
  "[[3": 2098,
  "[5]]": 2099,
  "hat": 2100,
  "hats:": 2101,
  "4]]": 2102,
  "hats[i][j]": 2104,
  "rectangular": 2105,
  "colsmatrix": 2106,
  "characters:": 2107,
  "apple": 2108,
  "pieces": 2109,
  "cuts": 2110,
  "direction:": 2111,
  "boundary": 2112,
  "piece": 2113,
  "cutting": 2114,
  "==pizza": 2115,
  "==pizza[i]": 2116,
  "painting": 2117,
  "2*3+": 2119,
  "3*1": 2120,
  "nums1and": 2123,
  "dot": 2124,
  "productbetweennon": 2125,
  "5]is": 2126,
  "of[1": 2127,
  "5]while": 2128,
  "3]is": 2129,
  "2*3": 2130,
  "[7]": 2131,
  "3*7": 2132,
  "robots": 2133,
  "you:": 2134,
  "#1": 2135,
  "#2": 2136,
  "moment": 2137,
  "cherries:": 2138,
  "2n": 2140,
  "balls": 2141,
  "colors": 2142,
  "balls[i]": 2143,
  "shuffled": 2144,
  "uniformly": 2145,
  "distribute": 2146,
  "box": 2147,
  "read": 2148,
  "explanation": 2149,
  "carefully": 2150,
  "boxes": 2151,
  "distribution": 2152,
  "[a]": 2153,
  "[b]": 2154,
  "correct": 2155,
  "equally:": 2156,
  "ball": 2157,
  "2/2": 2158,
  "shuffles": 2160,
  "1/12": 2161,
  "add": 2162,
  "distributions": 2163,
  "8/12": 2164,
  "display": 2165,
  "check": 2166,
  "houses": 2167,
  "small": 2168,
  "house": 2169,
  "painted": 2170,
  "summer": 2171,
  "neighborhood": 2172,
  "continuous": 2173,
  "neighborhoods": 2174,
  "[{1}": 2175,
  "2}": 2176,
  "{3": 2177,
  "{2}": 2178,
  "1}]": 2179,
  "houses[i]:": 2180,
  "yet": 2181,
  "cost[i][j]:": 2182,
  "[{2": 2183,
  "{1}": 2184,
  "2}]": 2185,
  "[{3}": 2186,
  "{3}]": 2187,
  "houses[i]": 2188,
  "cost[i][j]": 2189,
  "although": 2190,
  "rowindex": 2191,
  "rowindexth": 2192,
  "optimize": 2193,
  "extra": 2194,
  "location": 2195,
  "street": 2196,
  "allocate": 2197,
  "mailboxes": 2198,
  "mailbox": 2199,
  "|3": 2200,
  "1|": 2201,
  "|4": 2202,
  "3|": 2203,
  "|9": 2204,
  "8|": 2205,
  "|10": 2206,
  "9|": 2207,
  "|20": 2208,
  "20|": 2209,
  "|2": 2210,
  "|5": 2211,
  "|12": 2212,
  "14|": 2213,
  "|18": 2214,
  "design": 2215,
  "parent[i]": 2216,
  "ancestor": 2217,
  "treeancestor": 2218,
  "class:": 2219,
  "int": 2220,
  "int[]": 2221,
  "initializes": 2222,
  "object": 2223,
  "getkthancestor": 2224,
  "[[7": 2225,
  "output": 2226,
  "[null": 2227,
  "grandparent": 2228,
  "parent[0]": 2229,
  "queries": 2230,
  "resulting": 2231,
  "courses": 2232,
  "relations": 2233,
  "relations[i]": 2234,
  "[prevcoursei": 2235,
  "nextcoursei]": 2236,
  "prerequisite": 2237,
  "relationship": 2238,
  "course": 2239,
  "prevcoursei": 2240,
  "nextcoursei:": 2241,
  "nextcoursei": 2242,
  "semester": 2243,
  "prerequisites": 2244,
  "semesters": 2245,
  "directed": 2246,
  "acyclic": 2247,
  "mat": 2248,
  "rectangles": 2249,
  "1x2": 2250,
  "2x1": 2251,
  "3x1": 2252,
  "1x3": 2253,
  "3x2": 2254,
  "mat[i][j]": 2255,
  "he/she": 2256,
  "loses": 2257,
  "doesn": 2258,
  "removes": 2259,
  "[[2]": 2260,
  "[6]]": 2261,
  "sleft": 2262,
  "sright": 2263,
  "aacaba": 2264,
  "acaba": 2265,
  "caba": 2266,
  "aac": 2267,
  "aaca": 2268,
  "aacab": 2269,
  "follows": 2270,
  "increment": 2271,
  "inclusive": 2272,
  "target[i]": 2273,
  "run": 2274,
  "compression": 2275,
  "method": 2276,
  "works": 2277,
  "byreplacing": 2278,
  "marking": 2279,
  "compress": 2280,
  "aabccc": 2281,
  "ccc": 2282,
  "c3": 2283,
  "compressed": 2284,
  "a2bc3": 2285,
  "adding": 2286,
  "astring": 2287,
  "mostk": 2288,
  "fromssuch": 2289,
  "version": 2290,
  "shas": 2291,
  "encodedversion": 2292,
  "aaabcccd": 2293,
  "compressing": 2294,
  "anything": 2295,
  "us": 2296,
  "a3bc3d": 2297,
  "decrease": 2298,
  "instance": 2299,
  "abcccd": 2300,
  "abc3d": 2301,
  "a3c3": 2302,
  "aabbaa": 2303,
  "a4": 2304,
  "aaaaaaaaaaa": 2305,
  "a11": 2306,
  "looks": 2307,
  "underlined": 2308,
  "10]]": 2309,
  "triangle[0]": 2310,
  "triangle[i]": 2311,
  "triangle[i": 2312,
  "triangle[i][j]": 2313,
  "youdo": 2314,
  "traverse": 2315,
  "reading": 2316,
  "present": 2317,
  "paths:": 2318,
  "wooden": 2320,
  "stick": 2321,
  "units": 2322,
  "labelled": 2323,
  "cuts[i]": 2324,
  "denotes": 2325,
  "wish": 2326,
  "sticks": 2327,
  "refer": 2328,
  "better": 2329,
  "leads": 2330,
  "scenario:": 2331,
  "rod": 2332,
  "rearranging": 2333,
  "photo": 2334,
  "try": 2335,
  "oranges": 2336,
  "kitchen": 2337,
  "orange": 2338,
  "actions": 2339,
  "2*": 2340,
  "9/3": 2341,
  "3/3": 2342,
  "6/2": 2343,
  "round": 2344,
  "divides": 2345,
  "calculates": 2346,
  "throws": 2347,
  "away": 2348,
  "increases": 2349,
  "decide": 2350,
  "thrown": 2351,
  "[6]": 2352,
  "union": 2353,
  "construct": 2354,
  "reorder": 2355,
  "constructed": 2356,
  "yields": 2357,
  "bst:": 2358,
  "orderings": 2359,
  "locations": 2360,
  "locations[i]": 2361,
  "ending": 2362,
  "reduces": 2363,
  "|locations[i]": 2364,
  "locations[j]|": 2365,
  "|x|": 2366,
  "absolute": 2367,
  "routes": 2368,
  "fuel:": 2369,
  "routes:": 2370,
  "balloons": 2371,
  "rope": 2372,
  "colors[i]": 2373,
  "balloon": 2374,
  "wants": 2375,
  "colorful": 2376,
  "asks": 2377,
  "help": 2378,
  "neededtime": 2379,
  "neededtime[i]": 2380,
  "abaac": 2381,
  "aabaa": 2382,
  "performed": 2383,
  "getting": 2384,
  "groups": 2385,
  "size1": 2386,
  "size2": 2387,
  "connection": 2388,
  "opposite": 2389,
  "connect": 2390,
  "[[15": 2391,
  "96]": 2392,
  "[36": 2393,
  "matter": 2394,
  "limit": 2395,
  "about": 2396,
  "8]]": 2397,
  "rightmost": 2398,
  "0th": 2399,
  "representation": 2400,
  "bits": 2401,
  "01": 2402,
  "00": 2403,
  "010": 2405,
  "011": 2406,
  "001": 2407,
  "000": 2408,
  "[ui": 2409,
  "vi]": 2410,
  "ui": 2411,
  "vi": 2412,
  "dth": 2413,
  "noticethatthe": 2414,
  "4}": 2415,
  "covers": 2416,
  "integral": 2417,
  "{": 2418,
  "}": 2419,
  "gives": 2422,
  "manager": 2423,
  "basketball": 2424,
  "upcoming": 2425,
  "tournament": 2426,
  "overall": 2427,
  "scores": 2428,
  "conflicts": 2429,
  "conflict": 2430,
  "younger": 2431,
  "older": 2432,
  "age": 2433,
  "lists": 2434,
  "ages": 2435,
  "scores[i]": 2436,
  "ages[i]": 2437,
  "explanation:it": 2438,
  "differ": 2439,
  "computer": 2440,
  "computation": 2441,
  "baba": 2442,
  "character:": 2443,
  "portions": 2444,
  "words[j][k]": 2445,
  "xth": 2446,
  "unusuable": 2447,
  "met": 2448,
  "acca": 2449,
  "bbbb": 2450,
  "caca": 2451,
  "abba": 2452,
  "baab": 2453,
  "vowels": 2454,
  "comes": 2455,
  "s[i+1]": 2456,
  "alphabet": 2457,
  "ao": 2458,
  "au": 2459,
  "ee": 2460,
  "eo": 2461,
  "eu": 2462,
  "ii": 2463,
  "oo": 2464,
  "uu": 2465,
  "destination:": 2467,
  "providing": 2468,
  "meaning": 2469,
  "v": 2470,
  "hhhvv": 2471,
  "hvhvh": 2472,
  "picky": 2473,
  "lucky": 2474,
  "hhvhv": 2475,
  "hhvvh": 2476,
  "hvhhv": 2477,
  "hvvhh": 2478,
  "vhhhv": 2479,
  "vhhvh": 2480,
  "vhvhh": 2481,
  "vvhhh": 2482,
  "ncr": 2483,
  "balanced": 2484,
  "s[j]=": 2485,
  "aababbab": 2486,
  "aaabbb": 2487,
  "aabbbb": 2488,
  "bbaaaaabb": 2489,
  "solution": 2490,
  "certain": 2491,
  "bug": 2492,
  "forbidden": 2493,
  "forbidden[i]": 2494,
  "lands": 2495,
  "[14": 2496,
  "and/or": 2497,
  "hold": 2498,
  "never": 2499,
  "customer": 2500,
  "quantities": 2501,
  "quantity[i]": 2502,
  "introvertscount": 2503,
  "extrovertscount": 2504,
  "people:": 2505,
  "introverts": 2506,
  "extroverts": 2507,
  "live": 2508,
  "assign": 2509,
  "living": 2510,
  "happiness": 2511,
  "calculated": 2512,
  "neighbor": 2513,
  "introvert": 2514,
  "extrovert": 2515,
  "gain": 2516,
  "neighbors": 2517,
  "north": 2518,
  "south": 2519,
  "west": 2520,
  "happiness:": 2522,
  "light": 2523,
  "purple": 2524,
  "concatenated": 2527,
  "ababc": 2528,
  "abab": 2529,
  "wordcontains": 2530,
  "asked": 2531,
  "incompatibility": 2532,
  "incompatibilities": 2533,
  "distributing": 2534,
  "particular": 2535,
  "delivering": 2536,
  "storage": 2537,
  "ports": 2538,
  "ship": 2539,
  "carry": 2540,
  "boxes[i]": 2541,
  "[portsi": 2542,
  "portscount": 2543,
  "maxboxes": 2544,
  "maxweight": 2545,
  "portsi": 2546,
  "port": 2547,
  "deliver": 2548,
  "weightsi": 2549,
  "respective": 2550,
  "limits": 2551,
  "delivered": 2552,
  "violating": 2553,
  "loaded": 2554,
  "trips": 2555,
  "strategy": 2556,
  "sixth": 2557,
  "leftmost": 2558,
  "receive": 2559,
  "found": 2560,
  "poor": 2561,
  "minimize": 2562,
  "cuboids": 2564,
  "dimensions": 2565,
  "cuboid": 2566,
  "cuboids[i]": 2567,
  "[widthi": 2568,
  "lengthi": 2569,
  "widthi": 2570,
  "widthj": 2571,
  "lengthj": 2572,
  "heightj": 2573,
  "rearrange": 2574,
  "stacked": 2575,
  "[[50": 2576,
  "[95": 2577,
  "53]": 2578,
  "[45": 2579,
  "12]]": 2580,
  "53x37": 2582,
  "facing": 2583,
  "45x20": 2585,
  "23x12": 2586,
  "[[38": 2587,
  "45]": 2588,
  "[76": 2589,
  "35x3": 2590,
  "7]]": 2591,
  "dimension": 2593,
  "11x7": 2594,
  "boundaries": 2595,
  "jobs[i]": 2596,
  "workers": 2597,
  "worker": 2598,
  "working": 2599,
  "devise": 2600,
  "assignment": 2601,
  "minimized": 2602,
  "assigning": 2603,
  "later": 2604,
  "engaging": 2605,
  "named": 2606,
  "environment": 2607,
  "wall": 2608,
  "food": 2609,
  "walked": 2610,
  "walls": 2611,
  "directions": 2612,
  "catjump": 2613,
  "mousejump": 2614,
  "staying": 2615,
  "####f": 2616,
  "#c": 2617,
  "catch": 2618,
  "queries[i]": 2619,
  "[ni": 2620,
  "ki]": 2621,
  "ni": 2622,
  "ki": 2623,
  "query": 2624,
  "[73": 2625,
  "660]]": 2626,
  "50734910]": 2627,
  "explanation:each": 2628,
  "6]:": 2629,
  "fill": 2630,
  "multiply": 2631,
  "6:": 2632,
  "1]:": 2633,
  "660]:": 2634,
  "abcbdd": 2638,
  "dd": 2639,
  "palindromes": 2640,
  "bcbddxy": 2641,
  "[numsl": 2642,
  "numsl+1": 2643,
  "numsr": 2644,
  "numsr]": 2645,
  "abs": 2646,
  "numsl": 2647,
  "2+3": 2648,
  "5+1": 2649,
  "events": 2650,
  "events[i]": 2651,
  "[startdayi": 2652,
  "enddayi": 2653,
  "valuei]": 2654,
  "startdayi": 2655,
  "attend": 2656,
  "valuei": 2657,
  "inclusive:": 2658,
  "attending": 2659,
  "overlap": 2660,
  "valued": 2661,
  "closest": 2662,
  "multipliers": 2663,
  "begin": 2664,
  "multipliers[i]": 2665,
  "multipliers[0]": 2666,
  "corresponds": 2667,
  "multipliers[1]": 2668,
  "explanation:an": 2669,
  "manner:": 2671,
  "subsequence1": 2672,
  "subsequence2": 2673,
  "concatenate": 2674,
  "subsequences:": 2675,
  "forwardas": 2676,
  "cacb": 2677,
  "cbba": 2678,
  "abcba": 2679,
  "dessert": 2680,
  "ingredients": 2681,
  "ice": 2682,
  "cream": 2683,
  "base": 2684,
  "flavors": 2685,
  "toppings": 2686,
  "dessert:": 2687,
  "topping": 2688,
  "inputs:": 2689,
  "basecosts": 2690,
  "basecosts[i]": 2691,
  "flavor": 2692,
  "toppingcosts": 2693,
  "toppingcosts[i]": 2694,
  "close": 2695,
  "combination": 2696,
  "total:": 2697,
  "desserts": 2698,
  "[z0": 2699,
  "z1": 2700,
  "z2": 2701,
  "zk]": 2702,
  "z0": 2703,
  "zk": 2704,
  "zi": 2705,
  "zi+1": 2706,
  "distancetolastnode": 2707,
